Merge pull request #1 from omercnkc/backend
LexiCore Güncel Versiyon
